using 4.2.0, i'm unable to replicate using the reproduction provided.

```
resource "cloudflare_page_rule" "rule" {
  zone_id  = "0da42c8d2132a9ddaf714f9e7c920711"
  target   = "terraform.cfapi.net/*"
  priority = 1
  status   = "active"

  actions {
    cache_level    = "cache_everything"
    edge_cache_ttl = 7200

    cache_key_fields {
      query_string {
        exclude = ["foo", "bar"]
      }
      host {}
      user {}
    }
  }
}
```

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_page_rule.rule will be created
  + resource "cloudflare_page_rule" "rule" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "terraform.cfapi.net/*"
      + zone_id  = "0da42c8d2132a9ddaf714f9e7c920711"

      + actions {
          + always_use_https    = false
          + cache_level         = "cache_everything"
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false
          + disable_zaraz       = false
          + edge_cache_ttl      = 7200

          + cache_key_fields {

              + host {
                  + resolved = false
                }

              + query_string {
                  + exclude = [
                      + "bar",
                      + "foo",
                    ]
                  + ignore  = (known after apply)
                  + include = (known after apply)
                }

              + user {
                  + device_type = (known after apply)
                  + geo         = (known after apply)
                  + lang        = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_page_rule.rule: Creating...
cloudflare_page_rule.rule: Creation complete after 1s [id=36255c7ab9376f9dc10edfc12848ec52]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
and with subsequent operations
```
$ terraform apply
cloudflare_page_rule.rule: Refreshing state... [id=36255c7ab9376f9dc10edfc12848ec52]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

have you definitely been able to replicate this on 4.2.0 with a new resource?